//--------------------------------------------------------------------------------
//
// ゲーム制作[camera.h]
// Author:Tatsuki Matsuda
//
//--------------------------------------------------------------------------------
#ifndef _CAMERA_H_
#define _CAMERA_H_
#include "main.h"
#include "input.h"

//--------------------------------------------------------------------------------
//マクロ定義
//--------------------------------------------------------------------------------
#define	MAX_POSV_Z		(290)		//カメラの奥行き
#define	MAX_POSV_Y		(200)		//カメラの高さ

//--------------------------------------------------------------------------------
//カメラの構造体
//--------------------------------------------------------------------------------
typedef struct
{
	D3DXVECTOR3 posV;			//現在の視点
	D3DXVECTOR3 posVDest;		//目的の視点
	D3DXVECTOR3	posR;			//現在の注視点
	D3DXVECTOR3	posRDest;		//目的の注視点
	D3DXVECTOR3	posU;			//上方向ベクトル
	D3DXVECTOR3 rot;			//カメラの向き
	D3DXMATRIX	mtxProjection;	//プロジェクションマトリックス
	D3DXMATRIX	mtxView;		//ビューマトリックス
}CAMERA;

//--------------------------------------------------------------------------------
//プロトタイプ宣言
//--------------------------------------------------------------------------------
void InitCamera(void);
void UninitCamera(void);
void UpdateCamera(void);
void SetCamera(void);
CAMERA*GetCamera(void);
#endif


