//-------------------------------------------------------------------------------
//
// ゲーム制作[game.cpp]
// Author:Tatsuki Matsuda
//
//-------------------------------------------------------------------------------
#include"game.h"			//ゲーム画面
#include"player.h"			//プレイヤーの表示
#include"enemy.h"			//プレイヤーの表示
#include"meshfield.h"		//メッシュフィールドの表示
#include"meshsky.h"			//メッシュスカイの表示
#include"Bullet.h"			//弾の表示
#include"light.h"			//ライトの表示
#include"camera.h"			//カメラの表示
#include"billboard.h"		//ビルボードの表示
#include"wall.h"			//壁の表示
#include"fade.h"			//フェード表示
#include"xinput_gamepad.h"	//Controllerの表示

//-------------------------------------------------------------------------------
//グローバル変数
//-------------------------------------------------------------------------------
bool g_bPause;				//ポーズ

//-------------------------------------------------------------------------------
//初期化処理
//-------------------------------------------------------------------------------
void InitGame(void)
{
	//プレイヤーの初期化処理
	InitPlayer();

	//エネミーの初期化処理
	InitEnemy();

	//メッシュフィールドの初期化処理
	InitMeshField();

	//弾の初期化処理
	InitBullet();

	//ライトの初期化処理
	InitLight();

	//カメラの初期化処理
	InitCamera();

	//ビルボードの初期化処理
	InitBillboard();

	//壁の初期化処理
	InitWall();

}

//-------------------------------------------------------------------------------
//終了処理
//-------------------------------------------------------------------------------
void UninitGame(void)
{
	//壁の終了処理
	UninitWall();

	//ビルボードの終了処理
	UninitBillboard();

	//カメラの終了処理
	UninitCamera();

	//ライトの終了処理
	UninitLight();

	//弾の終了処理
	InitBullet();

	//メッシュフィールドの終了処理
	UninitMeshField();

	//エネミーの終了処理
	UninitEnemy();

	//プレイヤーの終了処理
	UninitPlayer();
}

//-------------------------------------------------------------------------------
//更新処理
//-------------------------------------------------------------------------------
void UpdateGame(void)
{
	XinputGamepad*pXinputGamepad = GetXinputGamepad();

	//カメラの更新処理
	UpdateCamera();

	//Playerの更新処理
	UpdatePlayer();

	//敵の更新処理
	UpdateEnemy();

	//メッシュフィールドの更新処理
	UpdateMeshField();

	//壁の更新処理
	UpdateWall();

	//ビルボードの更新処理
	UpdateBillboard();

	//弾の更新処理
	UpdateBullet();

	//ライトの更新処理
	UpdateLight();

}

//-------------------------------------------------------------------------------
//描画処理
//-------------------------------------------------------------------------------
void DrawGame(void)
{

	//敵の描画処理
	DrawEnemy();

	//プレイヤーの描画処理
	DrawPlayer();

	//メッシュフィールドの描画処理
	DrawMeshField();

	//弾の描画処理
	DrawBullet();


}