//--------------------------------------------------------------------------------
//
// ゲーム制作[gameover.h]
// Author:Tatsuki Matsuda
//
//--------------------------------------------------------------------------------
#ifndef _GAMEOVER_H_
#define _GAMEOVER_H_
#include "main.h"

//--------------------------------------------------------------------------------
//プロトタイプ宣言
//--------------------------------------------------------------------------------
HRESULT InitGameOver(void);
void UninitGameOver(void);
void UpdateGameOver(void);
void DrawGameOver(void);

#endif

