//--------------------------------------------------------------------------------
//
// ゲーム制作[Meshsky.h]
// Author:Tatsuki Matsuda
//
//--------------------------------------------------------------------------------
#ifndef _MESHSKY_H_
#define _MESHSKY_H_
#include "main.h"
#include "input.h"

//--------------------------------------------------------------------------------
//メッシュスカイの構造体
//--------------------------------------------------------------------------------
typedef struct
{
	D3DXVECTOR3 pos;			//位置
	D3DXVECTOR3 rot;			//向き
}MESHSKY;

//--------------------------------------------------------------------------------
//プロトタイプ宣言
//--------------------------------------------------------------------------------
HRESULT InitMeshSky(void);
void UninitMeshSky(void);
void UpdateMeshSky(void);
void DrawMeshSky(void);
MESHSKY*GetMeshSky(void);
//bool HitPoligon(void);
#endif

