//--------------------------------------------------------------------------------
//
// ゲーム制作[Model.h]
// Author:Tatsuki Matsuda
//
//--------------------------------------------------------------------------------
#ifndef _MODEL_H_
#define _MODEL_H_
#include "main.h"
#include "input.h"

//--------------------------------------------------------------------------------
//モデルの構造体
//--------------------------------------------------------------------------------
typedef struct
{
	D3DXVECTOR3 pos;			//現在の位置
	D3DXVECTOR3 posDest;		//目的の位置
	D3DXVECTOR3 rot;			//現在の向き
	D3DXVECTOR3 rotDest;		//目的の向き
}MODEL;

//--------------------------------------------------------------------------------
//プロトタイプ宣言
//--------------------------------------------------------------------------------
void InitModel(void);
void UninitModel(void);
void UpdateModel(void);
void DrawModel(void);
MODEL*GetModel(void);
//bool HitPoligon(void);
#endif


