//--------------------------------------------------------------------------------
//
// ゲーム制作[wall.h]
// Author:Tatsuki Matsuda
//
//--------------------------------------------------------------------------------
#ifndef _WALL_H_
#define _WALL_H_
#include "main.h"
#include "input.h"

//--------------------------------------------------------------------------------
//プロトタイプ宣言
//--------------------------------------------------------------------------------
HRESULT InitWall(void);
void UninitWall(void);
void UpdateWall(void);
void DrawWall(void);
void SetWall(void);
#endif

